Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། དངོས་པོ་གང་ཡོངས་སུ་གཏོང་བའི་དངོས་པོ་དེ་ལ་མཚན་མའི་འདུ་ཤེས་མི་བྱའོ། །དེ་ལྟར་མཚན་མ་མེད་པར་ཡོངས་སུ་གཏོང་ཞིང་།
en: “Moreover, Venerable Pūrṇa, when bodhisattva great beings practice the perfection of generosity, they should not conceive of the object that is offered in a conceptual manner.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན།
en: Instead, bodhisattvas should give free of any concepts and then dedicate the merit toward the state of omniscience.

source: ཕན་འདོགས་པར་གྱུར་པ་ཡིན་ནོ།
en: When giving in this manner, it will be of benefit.

source: །མཚན་མ་མ་སྤངས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་མི་འགྱུར་ཏེ།
en: Without abandoning conceptuality in this way, they will never attain perfect awakening. “

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྙེད་པ་འདི་ནི་རྙེད་པ་ཆེ་བ་ཡིན་ནོ།
en: Attaining omniscience is a great attainment.

source: །བྱ་བ་དག་གིས་གསེར་བྱེ་བའམ། རིན་པོ་ཆེ་བྱེ་བ་འདུ་བ་གང་ཡིན་པ་དེ་ནི་རྙེད་པ་ཆེ་བ་མ་ཡིན་གྱི།
en: In comparison, securing a profit of millions of gold coins, or hoarding millions of gemstones, should not be considered a great achievement.

source: གང་མཚན་མ་མེད་པར་དངོས་པོ་ཡོངས་སུ་བཏང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ཉིད་རྙེད་པ་ཁྱད་པར་དུ་འཕགས་པ་ཡིན་ནོ།
en: Moreover, to give objects away in a manner that is beyond conceptuality and thereby awaken to unsurpassed and perfect buddhahood is the most exalted attainment of all.

source: །གང་མཚན་མ་ཡོངས་སུ་མ་སྤངས་པར་གླིང་ཆེན་པོ་བཞིར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཐོབ་པར་གྱུར་དུ་ཟིན་ཀྱང་། དེ་ནི་རྙེད་པ་ཆེན་པོ་མ་ཡིན་ལ།
en: Even if one were to attain the kingdom of a universal monarch of the four continents, but not abandon conceptuality, it would not be a great achievement.

source: མཚན་མ་མ་སྤངས་པར་འདོད་པའི་ཁམས་སུ་བདག་པོའི་བྱ་བ་བྱེད་དུ་འཇུག་པ་འདི་ཡང་རྙེད་པ་ཆེན་པོར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: And even if one were to rule the desire realm, yet did not abandon conceptuality, it would not be a great achievement.

source: གལ་ཏེ་མཚན་མ་ཡོངས་སུ་སྤངས་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ན། འདི་ནི་རྙེད་པ་ཤིན་ཏུ་ཆེ་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: On the other hand, if one abandons concepts and attains the result of a stream enterer, a once-returner, a non-returner, a worthy one, or a solitary buddha, that should be recognized as a much greater achievement.

source: །གང་མཚན་མ་ཡོངས་སུ་སྤངས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པ་འདི་ཡང་རྙེད་པ་ཆེ་བ་ཡིན་ཏེ།
en: Still, abandoning conceptuality and attaining unsurpassed and perfect awakening is the greatest attainment of all.

source: འདི་ནི་རྙེད་པ་སྔ་མ་དེ་བས་རྙེད་པ་ཤིན་ཏུ་ཆེ་བ་སྟེ།
en: Such an attainment is much greater than any of those other achievements.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྙེད་པ་འདི་ནི་མཉམ་པའི་ཟླ་མེད་དེ། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྙེད་པ་ཡིན་ནོ། །གང་གོས་དང་།
en: This attainment by the bodhisattva great beings is unequaled; it is the attainment of the state of a thus-gone one.

source: ཁ་ཟས་དང་། མལ་ཆ་དང་། སྟན་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་མཚན་མར་ཡོངས་སུ་གཟུང་བའི་དངོས་པོ་ནི་བསྐྱེད་པར་མི་བྱའོ།
en: One should not be concerned with any objects that are apprehended conceptually, such as clothes, food, bedding, seats, medicines, or other implements.

source: དེ་ནི་མཚན་མའི་གྲངས་སུ་གཏོགས་པའི་ཕྱིར་རོ། །གང་ཡང་གོས་དང་། ཁ་ཟས་དང་།
en: Because they belong to the realm of concepts.

source: མལ་ཆ་དང་། སྟན་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་དེ་ཡང་ཡོངས་སུ་བཏང་ལ། ཐབས་ལ་མཁས་པས་ཡོངས་སུ་བསྔོས་ན།
en: Anyone who gives away their clothes, food, bedding, seats, medicines, and other implements while skillfully dedicating the merit will attain omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་བོ། །དེ་ལྟ་བས་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྙེད་པ་མཆོག་ཡིན་པར་རིག་པར་བྱའོ།
en: Therefore, one should recognize that the attainment of a bodhisattva great being is supreme.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་དུ། ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་ཐོབ་པར་འགྱུར་རོ།
en: One should address such bodhisattvas with these words, ‘You are bound to become omniscient.

source: ཁྱོད་ཀྱིས་གང་ལ་མཚན་མར་བཟུང་བའི་དངོས་པོ་འདི་ནི་རྙེད་པར་དཀའ་བ་སྟེ། ནང་དང་ཕྱི་རོལ་གྱི་དངོས་པོ་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་དབེན་པའི་ཕྱིར་རོ།
en: Because all inner and outer entities are devoid of an essence, and thus you scarcely apprehend any objects conceptually.

source: །དེ་ལྟར་ན་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་ཐོབ་པར་འགྱུར་རོ། །གང་དག་གིས་ཐོབ་པ་དང་། གང་དག་འཐོབ་པ་དང་།
en: This is why you will attain omniscience.

source: འཐོབ་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ན་ཐོབ་བོ། །འཐོབ་བོ། །འཐོབ་པར་འགྱུར་རོ་ཞེས་སྨྲ་བར་བྱའོ།
en: Anyone who ever attained this mind state, as well as all those who attain it now, and those who ever will attain this state, are certain to attain omniscience.’ ”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་བགྲང་བ་འདི་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་ཡིན་སྨྲས་པ།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable One, which classification of the bodhisattvas does this refer to?

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པའི་བགྲང་བ་ཡིན་ནོ།
en: This relates to the category of the bodhisattvas’ skillfulness.

source: སེམས་ཅན་འདི་དག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ན་འཐོབ་པར་དེ་ལྟར་ཤེས་སུ་ཟིན་ན་ནི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་ཞིག་ན།
en: Because if these beings understood how to attain omniscience, all beings would attain omniscience.

source: གང་གི་ཕྱིར་འདི་ལྟར་དེ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མ་མོས་ཤིང་།
en: Nevertheless, none of them are interested in omniscience; none of them arouse that attitude.

source: སེམས་མི་སྐྱེད་པའི་ཕྱིར་ཏེ། གང་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་མི་སྐྱེད་པ་དེ་དག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་རོ།
en: Therefore, as they do not engender the mind set upon omniscience, neither do any of them attain that state.

source: །གང་དག་འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མོས་ཤིང་སེམས་བསྐྱེད་པ་དག་ནི།
en: It is those who are devoted to the state of omniscience and set their mind upon it who attain that state.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་ཏེ། སེམས་དེ་བསྐྱེད་ནས། དངོས་པོ་གང་དང་གང་ཡོངས་སུ་གཏོང་བ་དེ་དང་དེ་དངོས་པོ་མེད་པར་མཐོང་ངོ་།
en: After they set their mind upon omniscience, they also come to understand that any object that they give away does not truly exist.

source: །དངོས་པོ་གང་དང་གང་ཤེས་པ་ལ་འདི་དག་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: So they tell themselves, ‘These entities that I perceive are an illusion.

source: འདི་ནི་ཇི་ལྟར་བདག་གིས་མཚན་མར་བཟུང་བ་ལྟར་མ་ཡིན་ནོ་སྙམ་ནས་དེ་གཏོང་བའི་བློ་ཤས་ཆེ་བར་འགྱུར་ཞིང་།
en: They are not actually the way that I perceive them conceptually.’

source: སྦྱིན་པའི་བློ་དང་ལྡན་པར་འགྱུར་ཏེ། འཛིན་པའི་སེམས་མི་སྐྱེད་དོ།
en: In this way they further develop their charitable attitude and generosity and do not cling to things.

source: །འདི་ལྟར་དངོས་པོ་འདི་ནི་སྒྱུ་མ་ལྟ་བུར་སེམས་ཅན་རྣམས་ཀྱིས་དེ་ལྟར་མི་ཤེས་པས། དངོས་པོ་དེ་དག་ལ་ཤས་ཆེར་མངོན་པར་ཞེན་པར་འགྱུར་ཏེ། ཡོངས་སུ་མི་གཏོང་བའི་བློར་འགྱུར་རོ།
en: However, even though the object is illusory, other beings do not understand that and so they continue to cling so intensely to things and are unable to give them away.

source: །ཡོངས་སུ་མི་གཏོང་བས་སེར་སྣ་ཡོངས་སུ་འཛིན་ཏོ།
en: Being unable to give anything away, they are gripped by miserliness.

source: །སེར་སྣ་དེས་ཀྱང་ངན་སོང་རྣམས་སུ་སྐྱེ་བར་འགྱུར་ལ། དངོས་པོ་དེ་དང་ཡང་འབྲལ་བར་འགྱུར་རོ།
en: And due to miserliness they take birth in the lower realms where they end up destitute.

source: །དེ་ལྟར་དངོས་པོ་དེ་ཡང་ཡོངས་སུ་མི་གཏོང་ཞིང་ཡོངས་སུ་མ་སྤྱད་ལ། དངོས་པོ་དེ་ལས་བརྟེན་ནས་སེར་སྣ་བསྐྱེད་དེ། ངན་སོང་རྣམས་སུ་ཡང་སྐྱེ་བར་འགྱུར་རོ།
en: In this way, if one is unable to give away or make use of an object, that object can become the cause of miserliness and birth in the lower realms.

source: །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པས་འདི་ལྟར་ཤེས་ཏེ། དངོས་པོ་འདི་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ། ཡོངས་སུ་གཏོང་བ་ཡང་སྒྱུ་མ་ལྟ་བུ་ཡིན་པས་ན།
en: Whenever skillful bodhisattva great beings understand this, they will tell themselves, ‘This object is illusory and the act of giving it away is also illusory.

source: སྒྱུ་མ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བདག་གི་ཡང་མ་ཡིན་ཡོངས་སུ་གཏོང་བ་ཡང་མ་ཡིན་ནོ།
en: That which is illusory does not really belong to me, nor can it truly be given away.

source: འདི་ལྟར་དེ་སྒྱུ་མ་ལྟ་བུ་ཡིན་པའི་ཕྱིར།
en: Because it is illusory.

source: དེ་དངོས་པོ་དེ་རྒྱ་ཆེར་ཡོངས་སུ་གཏོང་ངོ་སྙམ་དུ་སེམས་སོ།
en: Nonetheless, I will now make an extensive gift of it!’ “

source: །དེ་དེ་ཡོངས་སུ་གཏོང་བས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་འདོད་པ་སྐྱེད་དེ།
en: By being generous in this manner, those bodhisattvas will begin to emulate the blessed buddhas.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ལེགས་པར་གསུང་བ། ཕྱིན་ཅི་མ་ལོག་པར་གསུང་བ་ཁོ་ན་སྟེ། སྒྱུ་མ་ལྟ་བུའི་དངོས་པོ་ཡོངས་སུ་བཏང་བས། ཡོད་པའི་མཚན་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་འདི་ནི་ངོ་མཚར་ཏོ།
en: They are amazed by the statement of the blessed buddhas—who only explain well and free from any error—that the mark of giving away illusory objects is full awakening to perfect buddhahood.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཇི་ལྟར་བྱས་ན་བྱང་ཆུབ་སེམས་དཔའ་དངོས་པོ་དེ་དག་ལ་མངོན་པར་ཞེན་པ་མི་སྐྱེད་ཅིང་། འདི་ལྟར་དེ་ཡོངས་སུ་གཏོང་བའི་བློར་འགྱུར་སྙམ་སྟེ།
en: In this regard, as bodhisattva great beings then begin to emulate the blessed buddhas, they will not develop any clinging to these objects but will be inclined to offer them to others in a similar way.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དངོས་པོ་དེ་དག་དང་། རྐྱེན་དེ་དག་མཚན་ཉིད་མེད་པར་སྟོན་པ་འདི་དག་ནི་དཀའ་བ་མཛད་པའོ་སྙམ་དུ་རིག་པར་བྱའོ།
en: They should also appreciate the hardship their teachers underwent to show bodhisattva great beings that the objects and circumstances they encounter are without characteristics.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་ཐོབ་པར་འགྱུར་རོ་ཞེས་དེ་ལྟར་རིག་པར་བྱའོ།
en: Venerable Pūrṇa, you should think, ‘This is how bodhisattva great beings seek to awaken to unsurpassed and perfect buddhahood, thereby attaining the state of omniscience.’

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གལ་ཏེ་འདི་ནི་ཤ་ར་དྭ་ཏིའི་བུའི་སྤོབས་པ་ཡིན་ནོ་སྙམ་དུ་ཁྱོད་ཀྱིས་ཤེས་ན་དེ་ལྟར་མི་བལྟའི། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་ཤ་ར་དྭ་ཏིའི་བུ་སྨྲ་བར་ཟད་དོ།
en: Venerable Pūrṇa, in case you should think, ‘This teaching is due to Śāradvatīputra’s eloquence,’ that is not the case, since I have delivered this teaching due to the blessings of the Thus-Gone One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུས་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་ཟུང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Then the Blessed One spoke to Venerable Ānanda, “Ānanda, please pay attention to the discourse of the elder Śāradvatīputra. You should remember it, retain it, recite it, and master it.”

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་མཚན་མ་མེད་པའི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: This concludes the fourth chapter from “The Perfection of Generosity” entitled “Nonconceptuality.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཡོངས་སུ་གཏོང་བ་དེས་ཅི་ཞིག་ཡོངས་སུ་བཏང་བ་ལགས།
en: Venerable Pūrṇa Maitrāyaṇīputra asked the Blessed One, “Blessed One, when bodhisattva great beings give in this manner, what sort of giving is that?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཡོངས་སུ་གཏོང་བ་དེས་ཅི་ཡང་ཡོངས་སུ་བཏང་བ་མེད་དོ།
en: The Blessed One replied, “Pūrṇa, when bodhisattva great beings give in this manner, it is not actually giving.

source: །ཇི་ལྟར་ཡོངས་སུ་བཏང་བ་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཅི་ཡང་ཐོབ་པ་མེད་དོ།
en: Just as there is no act of giving, so there is also nothing to attain.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དངོས་པོ་ཅི་ཡང་ཡོངས་སུ་བཏང་བ་མེད་པ་དེ་བཞིན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་ཀྱང་ཆོས་ཅི་ཡང་ཐོབ་པ་མེད་དོ། །
en: The Blessed One continued, “Pūrṇa, just as bodhisattva great beings do not give any real objects away, so there is nothing to attain even by awakening to unsurpassed and perfect buddhahood. “

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགོད་པ་ཅི་འདྲ་བ་དེ་བཞིན་དུ། ཆོས་ཀྱི་འདུ་བའི་སྒོ་ཡང་དེ་ཁོ་ན་དང་འདྲ་བར་འགྱུར་རོ།
en: Pūrṇa, the dwelling place of a bodhisattva great being is just like a Dharma treasury.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་འགའ་ཞིག་ཡོངས་སུ་བཏང་བར་གྱུར་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་ཀྱང་ཡོད་པ་ཞིག་ཐོབ་པར་འགྱུར་ན་གང་པོ་གང་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་གཏོང་བ་བྱེད་པ་ན་དངོས་པོ་ཡོད་པ་ཅི་ཡང་ཡོངས་སུ་བཏང་བ་མེད་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཡོད་པའི་ཆོས་ཅི་ཡང་ཐོབ་པ་མེད་དོ།
en: If a bodhisattva great being were to give away any truly existing objects, that bodhisattva would also attain a real result of awakening to unsurpassed and perfect buddhahood. However, Pūrṇa, since there are no real phenomena that the bodhisattva great being can give away, there is also not any truly existent object that the bodhisattva great being could attain when awakening to unsurpassed and perfect buddhahood. “

source: །གང་པོ་དཔེར་ན།
en: Pūrṇa, consider this analogy.

source: སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མས་སྒྱུ་མ་མཁན་གྱི་ལག་ཏུ་ལ་དུ་ཞིག་བཙོངས་ལ། དེ་ལ་སྒྱུ་མ་མཁན་གྱིས་ཀཱར་ཥ་པ་ཎ་དག་གཅིག་མངོན་པར་སྤྲུལ་ཏེ་བྱིན་ན། གང་པོ་དེ་ལྟར་ན།
en: If a magician, or the apprentice of a magician, sells an illusory sweet to another magician, that magician can also conjure up a coin and pay for the sweet.

source: རིན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལ་དུ་ཡང་དེ་དང་འདྲའོ།
en: Pūrṇa, in that case both the payment and the sweet would be the same.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་ཇི་ལྟ་བུ་ཡོངས་སུ་བཏང་བ་དེ་བཞིན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཡང་དེ་ཁོ་ན་དང་འདྲའོ། །གང་པོ་དེ་ལྟ་བས་ན་འདུ་བ་ཅི་འདྲ་བ་དེ་བཞིན་དུ།
en: Similarly, the gift offered by a bodhisattva great being and his full awakening to unsurpassed and perfect buddhahood are identical.

source: དགོད་པ་ཡང་དེ་ཁོ་ན་དང་འདྲ་སྟེ།
en: Pūrṇa, what is laid out is just the same as what is amassed.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་རིན་ཅི་འདྲ་བ་དེ་བཞིན་དུ་རྙེད་པ་ཡང་དེ་ཁོ་ན་དང་འདྲ་བ་ཡིན་ནོ།
en: And similarly, the value of the bodhisattva’s gift would be just the same as that which is to be gained. “

source: སྐྱེས་བུ་སྒྱུ་མ་མཁན་གྱིས་ཤིང་ལྗོན་པ་ཞིག་མངོན་པར་སྤྲུལ་ལ། ཤིང་ལྗོན་པ་དེའི་དྲུང་དུ་ཡང་སྲོག་ཆགས་འབུམ་སྤྲུལ་ཏེ།
en: A magician might conjure up a tree with one hundred thousand animals living at its foot.

source: སྲོག་ཆགས་དེ་དག་ཀྱང་ཤིང་ལྗོན་པ་དེའི་འབྲས་བུ་རྣམས་ཟ་ན། གང་པོ་དེ་ནི་འབྲས་བུ་ཇི་ལྟ་བ་བཞིན་དུ་ཟབ་པོ་རྣམས་ཀྱང་དེ་ཁོ་ན་དང་འདྲའོ།
en: As the animals then eat the fruits of the tree, Pūrṇa, both the fruits and those who eat them are the same.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་གཏོང་བ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་འདུ་བའི་སྒོ་ཡང་དེ་ཁོ་ན་དང་འདྲའོ།
en: In the same way, the gifts of a bodhisattva great being are just like revenues being collected.

source: །གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་གཏོང་བ་ན་རིན་དང་། རྙེད་པ་དང་། རྙེད་པ་དང་རིན་དུ་མཉམ་པར་འགྱུར་རོ།
en: Pūrṇa, in this way, when bodhisattva great beings give away their belongings, the wealth given away is identical to the gain made and the gain made is identical to the wealth that is given away. “

source: །གང་པོ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Pūrṇa, think of this analogy.

source: སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་ལམ་གྱི་བཞི་མདོ་ཆེན་པོར་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་མདུན་དུ་བུད་མེད་གཅིག་མངོན་པར་སྤྲུལ་ལ།
en: A magician, or the skilled apprentice of a magician, might conjure up a woman at a large intersection where everyone could see her.

source: བུད་མེད་དེ་ཡང་སྦྲུམ་མར་མངོན་པར་སྤྲུལ་ཏེ་བུ་བྱུང་བར་བསྟན་ནས། བུད་མེད་དེའི་བུ་བཙས་ལ། ཁྱེའུ་ཞིག་ཏུ་བཙས་ནས། ཁྱེའུ་དེ་ཡང་ཤི་བར་བསྟན་ན།
en: He might then create the illusion that the woman was pregnant and that she gave birth to a son. Once the son was born, the magician might create the illusion that the son died.

source: གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་ཁྱེའུ་ཤི་བ་དེའི་ཚེ་ན་བུད་མེད་དེ་ལ་བདག་གི་བུ་ཤིའོ་སྙམ་པའི་སེམས་སྐྱེ་འམ།
en: Pūrṇa, tell me, when the son died, would that woman think that her son had passed away?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །
en: Pūrṇa replied, “No, Blessed One, she would not.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་ལྟ་ན། མ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བུ་ཡང་དེ་ཁོ་ན་དང་འདྲ་སྟེ།
en: The Blessed One said, “Pūrṇa, in that case the mother and the son are alike.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པ་ཇི་ལྟ་བ་བཞིན་དུ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དེ་ཁོ་ན་དང་འདྲའོ།
en: In the same way, the generosity of a bodhisattva great being and the state of omniscience are exactly alike.

source: །གང་པོ་དེ་ལྟར་ན་འདིར་ཡང་ཆོས་དེ་དག་གི་འདུ་བའི་སྒོ་གཉི་ག་མེད་དོ།
en: Pūrṇa, therefore, in this case the Dharma treasury is nondual.

source: །གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་ཁྱོད་ཀྱིས་ང་ཆོས་འགའ་ཞིག་ལ་འདོད་པ་ཆེ་བར་མཐོང་ངམ།
en: Pūrṇa, tell me, do you see me as having desire for any phenomena?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: Pūrṇa replied, “No, Blessed One, I do not.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་དེ་དག་སྟོང་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སླད་དུ་ལགས་སོ།
en: Blessed One, because the Thus-Gone One has realized that phenomena are empty.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་བཞིན་དུ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཆོས་གང་ལ་ཡང་འདོད་པ་ཆེ་བ་མེད་པ་དེ་བཞིན་དུ་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པའི་ཚེ་ཆོས་གང་ལ་ལ་ཞིག་ཡོངས་སུ་མ་བཏང་བ་དེ་མེད་དོ།
en: The Blessed One said, “Pūrṇa, likewise, just as the Thus-Gone One now does not feel any desire for phenomena, I had no problem giving away everything when I was a bodhisattva.

source: །དེ་བས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ནི་ཆགས་པའམ། ཁོང་ཁྲོ་བ་འགའ་ཡང་མི་སྐྱེའོ།
en: Therefore, the blessed buddhas do not entertain any form of desire or anger.

source: འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤངས་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because the blessed buddhas have given up all desire and anger.”

source: གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དངོས་པོ་གང་དང་གང་ཡོངས་སུ་གཏོང་བ་དེ་དང་དེ་ཉིད་སྟོང་པའམ། ཡ་མ་བརླ་འམ། གསོབ་བམ། གསོག་ཏུ་མཐོང་བ་ནི་ངོ་མཚར་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན།
en: Pūrṇa said, “Blessed One, it is wonderful how bodhisattva great beings are able to give away any object, seeing them to be essentially empty, hollow, without substance, and unreal.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དབྱིག་དང་། གསེར་གྱིས་བཀང་སྟེ་སློང་བ་རྣམས་ལ་སྩལ་ཀྱང་། བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་ཡོངས་སུ་གཏོང་བའི་ཐབས་མ་འཚལ་ན།
en: As I understand the meaning of the teaching spoken by the Blessed One, even if a bodhisattva were to fill as many worlds as there are grains of sand in the Ganges with gold and riches and give it all to a beggar, that bodhisattva must still be skillful when giving.

source: དེ་ལྟ་ན་དེས་ནི་སྦྱིན་པ་ཉི་ཚེར་འགྱུར་གྱི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མ་ལགས་སོ།
en: Otherwise, it would only be a limited gift, rather than the perfection of generosity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་གཏོང་བ་ན། འདི་ལྟར་ཡང་བདག་གིས་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ་སྙམ་དུ་ཡང་སེམས་བསྐྱེད་པར་བགྱིའོ།
en: When bodhisattva great beings give, they do so thinking, ‘I will give up all my possessions.’ ”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། བསྟན་པ་འདིའི་དོན་བཤད་པའི་ཕྱིར་སྤོབས་པར་གྱིས་ཤིག །
en: Then the Blessed One said to Venerable Śāradvatīputra, “You should have the courage to explain the meaning of this teaching.

source: ངས་བཤད་པའི་དུས་ལ་བབ་པ་ན་ཡང་བཤད་པར་བྱའོ།
en: Even though this is the time for me to speak, I would like you to explain this.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཆོས་ཐམས་ཅད་སྟོང་པར་ཡིད་ལ་བྱེད་ཅིང་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: So Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, in this regard, bodhisattva great beings wishing to awaken to unsurpassed and perfect buddhahood should consider all phenomena to be empty and practice generosity.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པར་བྱས་ནས། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ།
en: While keeping their focus on the state of omniscience, they should give away all their belongings.

source: །ཟིན་པ་དང་མ་ཟིན་པའི་དངོས་པོ་རྣམས་ཡོངས་སུ་མ་བཏང་བའམ། མ་བྱིན་པའམ། མཆོད་སྦྱིན་མ་བྱས་པ་ཅི་ཡང་མེད་པར་བྱའོ།
en: They should definitely give up any form of not relinquishing, not giving, and not offering any object, whether in their own possession or not.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: Venerable Pūrṇa, in this way bodhisattva great beings should give with a mind set upon omniscience.”

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་སྒྱུ་མ་ལྟ་བུར་བསྟན་པའི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: This concludes the fifth chapter from “The Perfection of Generosity” entitled “Showing Generosity to Be Illusory.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Chapter 6: The Activity of Bodhisattvas and the Teachings of Buddhas in Countless Worlds The Blessed One said to Venerable Śāradvatīputra, “Excellent, Śāradvatīputra, excellent!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པ་བྱས་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: Bodhisattva great beings should practice generosity while keeping their focus on the state of omniscience.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་མཐོང་བར་འདོད་དམ།
en: Śāradvatīputra, would you like to witness the bodhisattva great beings’ practice of generosity as it occurs in all the worlds in the eastern direction?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཇི་ལྟར་སྦྱིན་པ་སྦྱིན་པར་བགྱིད་པ་མཐོང་བར་འཚལ་ལོ།
en: Śāradvatīputra replied, “Yes, Blessed One, please grant me a vision of how the bodhisattva great beings in all the worlds in the eastern direction practice generosity!”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། དེ་ལས་གཞན་པའི་ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱིས་འདི་ནས་ཐད་ཀའི་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་སྒྱུ་མ་ཞེས་བྱ་བ་ན།
en: Then, through the Buddha’s power, Venerable Śāradvatīputra and the other great hearers and the entire retinue were transported directly to a world known as Illusory.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བ་ཉན་ཐོས་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: There they saw the thus-gone, worthy, perfect Buddha Great Assemblage teaching the Dharma to the hearers.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ཁྱིམ་ན་འདུག་ཅིང་ཁྱིམ་ན་འདུག་བཞིན་དུ་དབྱིག་དང་། གསེར་གྱི་ཕུང་པོ་རི་ཙམ་སྦྱིན་པ་སྦྱིན་ཞིང་ཡོངས་སུ་གཏོང་སྟེ།
en: They also saw a bodhisattva by the name Unhindered, who was sitting in his residence, generously distributing a mountain of his belongings and gold.

source: འདི་ལས་ཁྱེར་བའི་སེམས་ཅན་དེ་དག་ལ་སྦྱིན་པ་བྱིན་པར་གྱུར་ཅིག་ཅེས་སྒྲོགས་སོ།
en: To the people who were carrying the gifts away he would shout, “Please be generous!”
